[
  {
    "path": "posts/welcome/",
    "title": "Analyzing Educational Proficiency Data",
    "description": "This research explores trends in student proficiency in \nreading/language arts (RLA) and math across U.S. school districts, \nfocusing on the impact of socioeconomic status (SES). \nWe address data inconsistencies and missingness while \npreparing the dataset for analysis.",
    "author": [
      {
        "name": "Aden Bhagwat, Emily Mingus, Erick Ndjue",
        "url": "https://adenb0220.github.io/EDLD_652_Final/"
      }
    ],
    "date": "2025-03-04",
    "categories": [],
    "contents": "\nIntroduction\nSocioeconomic status (SES) has been shown to be a strong predictor of long-term success in reading and other academic outcomes. Studies suggest that children from lower SES backgrounds often face barriers to academic achievement, particularly in foundational areas like reading. Research has indicated that disparities in reading proficiency can impact long-term academic and life outcomes (see PMC article on SES and reading). Additionally, the American Psychological Association highlights the influence of SES on learning, noting that educational gaps tied to socioeconomic status can persist throughout a child’s educational trajectory.\nGiven these findings, our research aims to more closely examine how SES affects student proficiency across different grade levels in reading and math, and to identify where interventions may be needed most. We will also explore how SES-related trends in achievement can inform policy decisions at the district level, particularly focusing on whether there are grade levels where these disparities are more pronounced. If patterns emerge, these insights could be critical for guiding educational interventions and policies aimed at reducing achievement gaps within districts.\nResearch Questions\nOur study focuses on understanding how socioeconomic status (SES) affects educational proficiency in reading/language arts (RLA) and math. Specifically, we aim to answer the following questions:\nHow does SES affect student proficiency in math across different grade levels?\nHow does SES affect student proficiency in reading/language arts (RLA) across different grade levels?\nAre there consistent trends over time that highlight disparities between economically disadvantaged (ECD) students and all students?\nDemographic Information\nWe analyzed data from a substantial number of school districts (LEAs) across the U.S., spanning a variety of grade levels and proficiency categories. Specifically:\nTotal number of school districts: [Insert number of districts]\nTotal number of participants: [Insert number of participants]\nGrades represented: [Insert grade levels, e.g., “Kindergarten through 12th grade”]\nStudent groups: Data is compared between economically disadvantaged (ECD) students and all students.\nThis dataset provides valuable insights into the role of socioeconomic status in educational outcomes, and we are excited to dive into the analysis!\n\n\n\n",
    "preview": {},
    "last_modified": "2025-03-10T15:37:46-07:00",
    "input_file": "welcome.knit.md"
  },
  {
    "path": "posts/2025-03-08-all-students/",
    "title": "All Students",
    "description": "Prociency Scores: Compring all students to economically disadvantaged students",
    "author": [
      {
        "name": "Aden Bhagwat, Emily Mingus, Erick Njue",
        "url": "https://adenb0220.github.io/EDLD_652_Final/"
      }
    ],
    "date": "2025-03-03",
    "categories": [],
    "contents": "\n\n\n\nTo answer question 1 that examines the relationship between economic status or Social Economic Status (SES) and the proficiency scores, we first examine the relationship between the proficiency scores of all the students and those of students from economically disadvantaged students. Figure 1 shows the Math proficiency scores of all the students against those of economically disadvantaged students and Figure 2 shows the mean percent of the students in Math by their economic status. The Math proficiency for economically disadvantaged students is lower than that of all students.\nFigure 1\n\n\n\nFigure 2\n\n\n\nFigure 3 shows the Reading proficiency scores of all the students against those of economically disadvantaged students and Figure 4 shows shows the mean percent of the students in Reading by their economic status. All students perform better than economically disadvantaged students.\nFigure 3\n\n\n\nFigure 4\n\n\n\n\n\n\n",
    "preview": "posts/2025-03-08-all-students/all-students_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2025-03-10T15:07:48-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-02-26-post-2/",
    "title": "Math Proficiency by Grade Level",
    "description": "Math Profiency by Grade Level, Comparing Economically Disadvantaged Students to All Students.",
    "author": [
      {
        "name": "Aden Bhagwat, Emily Mingus, Erick Ndjue",
        "url": "https://adenb0220.github.io/EDLD_652_Final/"
      }
    ],
    "date": "2025-03-02",
    "categories": [],
    "contents": "\n\nAs our previous plot revealed that there are discrepancies between economically disadvantaged (ECD) students and the total student population in terms of reading and math proficiency, we decided to examine whether this trend differed by grade level. Our dataset included scores from 3rd grade to 8th grade, so we decided to look longitudinally for any changes in the proficiency gap between ECD and all students. We were especially curious if the gap would widen or narrow as students progress in school.\n\n\n\n\n\nWe started with a side by side bar graph, which seemed like the most straightforward way to display our desired information. This took a decent amount of data cleaning and filtering to accomplish, because our data also included a variable for ‘all grade levels.’ We also had to summarize averages and group variables to get our desired graph. While effective, the side by side plot did not highlight changes over time, but instead treated each grade as a separate comparison. We were able to add floating percentages for more precision, but the graph feels fairly crowded and busy. It is also difficult to visually identify any changes from grade to grade. While this is somewhat fine because changes are very small, it would be nice to be able to see at least a bit of variation more easily.\nI then asked ChatGPT for help varying the graph types and colors, to brainstorm ideas for making the graph more aesthetically pleasing and informative. The next graph type created was a line graph. While I liked that the line graph plotted the scores in a way that highlights changes over time, I felt that the y-axis needed to be from 0-100% to avoid falsely inflating the discrepancies between all students and ECD. The downside of this is that there is a lot of white space and the graph is fairly boring.\n\n\n\n\n\nNext we tried a stacked bar plot, to see if that would really demonstrate the gap in proficiency between our two groups. This was visually very confusing, because it makes the gap look much more intense. It is misleading, because it should be read as all students starting where ECD ends, so for example 3rd grade would start around 45% and end around 100%, indicating an average proficiency of about 55%.However, with the y-axis, it looks like all students in 3rd grade have almost a 100% proficiency. We definitely did not want to use this misleading graph.\n\n\n\n\n\n\nNext we tried a boxplot to illustrate the variation in each group, while still focusing on the fact that the median for all students is higher than the median for ECD students across each grade level. We also used the viridis palette to make the graph colorblind accessible. However, this graph is really busy and a but hard to interpret. It does include a lot of valuable information about variation and distributions, but may muddle the main point that we want to convey, that ECD students are performing lower on average than all other students.\n\n\n\n\n\nFinally, we tried a lollipop graph. This allowed us to see changes linearly over time by following from top to bottom, and did a nice job of highlighting our major takeaway. Each ECD line is shorter than the “All” line, indicating that there is a discrepancy. We were also able to add floating percentages for precision. The graph is relatively simple and minimal, while still providing information and staying interesting. Using the full 100% scale on the x axis both keeps the discrepancy accurately proportional, and highlights that neither group is more than 57% proficient, which is not ideal.\n\n\n\n\n\n\nWe decided that this was the most effective graph, but wanted to play around with the colors, themes, etc. to have it match the rest of our blog and be accessible. Please see the next post to see how we varied this plot to end up with our final product below:\n\n\n\n\n\n\n\n",
    "preview": "posts/2025-02-26-post-2/post-2_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2025-03-10T15:07:48-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-02-26-post-1/",
    "title": "Reading Proficiency by Grade Level",
    "description": "Reading Profiency by Grade Level, Comparing Economically Disadvantaged Students to All Students.",
    "author": [
      {
        "name": "Aden Bhagwat, Emily Mingus, Erick Ndjue",
        "url": "https://adenb0220.github.io/EDLD_652_Final/"
      }
    ],
    "date": "2025-03-01",
    "categories": [],
    "contents": "\nAs discussed in our previous post, we experimented with multiple types of graphs and color schemes before settling on a lollipop graph. However, we still needed to make adjustments to styling and themes to have the graph be optimized for our blog. We started with the first graph, using a green and orange color palette and minimal theme.\n\n\n\n\n\nWe then decided to try making the graph color blind friendly. We added the viridis color palette but ran into an issue, each viridis palette (magma, plasma, etc.) has a bright yellow color that is very washed out on a minimal theme. We tried adding a dark theme, but that was not very aesthetically pleasing and the darker numbers were difficult to read.\n\n\n\n\n\nWe realized we could set a beginning and end to the viridis colors, which could eliminate the bright yellow and make the graph more friendly for colorblind and non-colorblind viewers. This also allowed us to keep the theme_minimal(), which matched better with the rest of our blog. We kept playing with the beginning and end values until we were satisfied that the colors looked good while still remaining accessible. As final touches, we adjusted the legend to be horizontal and near the top.\n\n\n\n\n\nFinally, we used a colorblind function to check that our graph would be accessible for different types of colorblindness. We simplified the text in the grpah to focus on the color changes, and then used the function. This satisfied our color choices, because each group was still separately identifiable, so we decided to keep our final graph as is.\n\n\n\n\n\n\n\n",
    "preview": "posts/2025-02-26-post-1/post-1_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2025-03-10T15:07:48-07:00",
    "input_file": {}
  }
]
