[
  {
    "path": "posts/welcome/",
    "title": "Analyzing Educational Proficiency Data",
    "description": "This research explores trends in student proficiency in \nreading/language arts (RLA) and math across U.S. school districts, \nfocusing on the impact of socioeconomic status (SES). \nWe address data inconsistencies and missingness while \npreparing the dataset for analysis.",
    "author": [
      {
        "name": "Aden Bhagwat, Emily Mingus, Erick Njue",
        "url": "https://adenb0220.github.io/EDLD_652_Final/"
      }
    ],
    "date": "2025-03-04",
    "categories": [],
    "contents": "\r\nIntroduction\r\nSocioeconomic status (SES) has been shown to be a strong predictor of long-term success in reading and other academic outcomes. Studies suggest that children from lower SES backgrounds often face barriers to academic achievement, particularly in foundational areas like reading. Research has indicated that disparities in reading proficiency can impact long-term academic and life outcomes (see PMC article on SES and reading). Additionally, the American Psychological Association highlights the influence of SES on learning, noting that educational gaps tied to socioeconomic status can persist throughout a child’s educational trajectory.\r\nGiven these findings, our research aims to more closely examine how SES affects student proficiency across different grade levels in reading and math, and to identify where interventions may be needed most. We will also explore how SES-related trends in achievement can inform policy decisions at the district level, particularly focusing on whether there are grade levels where these disparities are more pronounced. If patterns emerge, these insights could be critical for guiding educational interventions and policies aimed at reducing achievement gaps within districts.\r\nResearch Questions\r\nOur study focuses on understanding how socioeconomic status (SES) affects educational proficiency in reading/language arts (RLA) and math. Specifically, we aim to answer the following questions:\r\nHow does SES affect student proficiency in math across different grade levels?\r\nHow does SES affect student proficiency in reading/language arts (RLA) across different grade levels?\r\nAre there consistent trends over time that highlight disparities between economically disadvantaged (ECD) students and all students?\r\nDemographic Information\r\nWe analyzed data from a substantial number of school districts (LEAs) across the U.S., spanning a variety of grade levels and proficiency categories. Specifically:\r\nTotal number of school districts: 15751 unique district IDs\r\nGrades represented: 3-8\r\nStudent groups: Data is compared between economically disadvantaged (ECD) students and all students.\r\nIt is unclear the exact number of students represented in the data, however we do know that there are 15751 unique district codes. The data reported include the average scores per grade per district. Therefore, claims can only be made in respect to trends by grade level and within/across districts by grade level.\r\nThis dataset provides valuable insights into the role of socioeconomic status in educational outcomes, and we are excited to dive into the analysis!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2025-03-18T07:50:01-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-03-08-all-students/",
    "title": "All Students",
    "description": "Proficiency Scores: Comparing all students to economically disadvantaged students",
    "author": [
      {
        "name": "Aden Bhagwat, Emily Mingus, Erick Njue",
        "url": "https://adenb0220.github.io/EDLD_652_Final/"
      }
    ],
    "date": "2025-03-03",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nWe began our study by comparing the relationship between Social Economic Status (SES) and the proficiency scores (Math and Reading) for all students as compared to those of economically disadvantaged students. To understand the relationship, we first focused on Math proficiency. We used Figure 1 which is a bar plot showing the Math proficiency scores of all the students against those of economically disadvantaged students.\r\nFigure 1 \r\n\r\n\r\n\r\nAs seen in Figure 1, on average, students from All Students are more proficient in Math compared to Economically Disadvantaged Students. The All Students group has a mean proficiency of around 65%, while the Economically Disadvantaged Students group has a mean proficiency closer to 55%. The large difference in the length of the bars highlights the disparity between the two groups in terms of math proficiency.To understand the relationship in Math proficiency for All Students group against the Economically Disadvantaged Student group in a better way we used a box plot in Figure 2.\r\nFigure 2\r\n\r\n\r\n\r\nAs seen in Figure 2, on average, students in the All Students group perform better than those in the Economically Disadvantaged group with both groups showing variation in proficiency. In the All students group, there are outliers that scored significantly lower than the majority. We concluded, on average, the Math proficiency for economically disadvantaged students is lower than that of all students. We then wanted to understand the relationship in Reading proficiency for All Students group as compared to the Economically Disadvantaged Students group. To examine this relationship, we first used a bar plot to visualize their distribution as presented in Figure 3.\r\nFigure 3\r\n\r\n\r\n\r\nAs figure 3 shows, on average, All Students perform better in reading than those from economically disadvantaged backgrounds. The All Students group has a mean proficiency above 60%, while the Economically Disadvantaged Students group is slightly above 50%. This suggests a persistent achievement gap between the two groups.The proficiency gap appears similar to the math proficiency although the reading scores might be slightly higher than math scores for both groups.To understand the relationship between reading proficiency and economic status in a deeper sense, we used a box plot as shown in Figure 4.\r\nFigure 4\r\n\r\n\r\n\r\nFigure 4 suggest that, on average, the All Students group perform better in reading compared to Economically Disadvantaged Students where the All Students group having slightly higher overall scores. The Economically Disadvantaged Students group has a lower minimum score, meaning some students in this category are performing much lower than their peers. There seem to be more outliers in the All Students group than the Economically Disadvantaged Students group.\r\nWe concluded that there is an achievement gap that exists between Math and Reading proficiency in both groups where Economically Disadvantaged Students consistently score lower than the All Students group possibly suggesting that economic status plays a significant role in academic performance. There is a greater score variability among the Economically Disadvantaged Students group where some students in this group perform well, but a significant number struggle, as seen in the outliers. The proficiency gap in reading mirrors the gap in math, suggesting that the issue is not subject-specific. However, before we made some further conclusions and implications, we wanted to know if the disparities seen in the results above were consistent across the grade levels. leading us to examine the relationship between SES and proficiency score in different grade levels.\r\n\r\n\r\n\r\n",
    "preview": "posts/2025-03-08-all-students/all-students_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2025-03-18T07:50:01-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-02-26-post-2/",
    "title": "Math Proficiency by Grade Level",
    "description": "Math Profiency by Grade Level, Comparing Economically Disadvantaged Students to All Students.",
    "author": [
      {
        "name": "Aden Bhagwat, Emily Mingus, Erick Njue",
        "url": "https://adenb0220.github.io/EDLD_652_Final/"
      }
    ],
    "date": "2025-03-02",
    "categories": [],
    "contents": "\r\n\r\nAs our previous plot revealed that there are discrepancies between economically disadvantaged (ECD) students and the total student population in terms of reading and math proficiency, we decided to examine whether this trend differed by grade level. Our dataset included scores from 3rd grade to 8th grade, so we decided to look longitudinally for any changes in the proficiency gap between ECD and all students. We were especially curious if the gap would widen or narrow as students progress in school.\r\n\r\n\r\n\r\n\r\n\r\n\r\nThis is our final graph, chosen for its accessibility and ability to convey our message. The main takeaway is that while only about half of students in all districts are proficient in math, this proficiency percentage is even lower when only examining economically disadvantaged (ECD) students. Also, there is variation in the gap between ECD students and all students from grade to grade, but it does not seem particularly significant. While 3rd graders are separated by about 10 percentage points, 8th graders are separated by about 14 percentage points. It is possible that the discrepancy increases as grade level increases, but this would require further statistical testing.We added subtitles to both final graphs (reading and math) to ensure our message is clear.\r\nPlease see below for the iterations of this graph\r\n\r\n\r\n\r\n\r\n\r\nWe started with a side by side bar graph, which seemed like the most straightforward way to display our desired information. This took a decent amount of data cleaning and filtering to accomplish, because our data also included a variable for ‘all grade levels.’ We also had to summarize averages and group variables to get our desired graph. While effective, the side by side plot did not highlight changes over time, but instead treated each grade as a separate comparison. We were able to add floating percentages for more precision, but the graph feels fairly crowded and busy. It is also difficult to visually identify any changes from grade to grade. While this is somewhat fine because changes are very small, it would be nice to be able to see at least a bit of variation more easily.\r\nI then asked ChatGPT for help varying the graph types and colors, to brainstorm ideas for making the graph more aesthetically pleasing and informative. The next graph type created was a line graph. While I liked that the line graph plotted the scores in a way that highlights changes over time, I felt that the y-axis needed to be from 0-100% to avoid falsely inflating the discrepancies between all students and ECD. The downside of this is that there is a lot of white space and the graph is fairly boring.\r\n\r\n\r\n\r\n\r\n\r\n\r\nNext we tried a stacked bar plot, to see if that would really demonstrate the gap in proficiency between our two groups. This was visually very confusing, because it makes the gap look much more intense. It is misleading, because it should be read as all students starting where ECD ends, so for example 3rd grade would start around 45% and end around 100%, indicating an average proficiency of about 55%.However, with the y-axis, it looks like all students in 3rd grade have almost a 100% proficiency. We definitely did not want to use this misleading graph.\r\n\r\n\r\n\r\n\r\n\r\n\r\nNext we tried a boxplot to illustrate the variation in each group, while still focusing on the fact that the median for all students is higher than the median for ECD students across each grade level. We also used the viridis palette to make the graph colorblind accessible. However, this graph is really busy and a but hard to interpret. It does include a lot of valuable information about variation and distributions, but may muddle the main point that we want to convey, that ECD students are performing lower on average than all other students.\r\n\r\n\r\n\r\n\r\n\r\n\r\nFinally, we tried a lollipop graph. This allowed us to see changes linearly over time by following from top to bottom, and did a nice job of highlighting our major takeaway. Each ECD line is shorter than the “All” line, indicating that there is a discrepancy. We were also able to add floating percentages for precision. The graph is relatively simple and minimal, while still providing information and staying interesting. Using the full 100% scale on the x axis both keeps the discrepancy accurately proportional, and highlights that neither group is more than 57% proficient, which is not ideal.\r\n\r\n\r\n\r\n\r\n\r\n\r\nWe decided that this was the most effective graph, but wanted to play around with the colors, themes, etc. to have it match the rest of our blog and be accessible. Please see the next post to see how we varied this plot to end up with our final product below:\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2025-02-26-post-2/post-2_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2025-03-18T08:29:52-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-02-26-post-1/",
    "title": "Reading Proficiency by Grade Level",
    "description": "Reading Profiency by Grade Level, Comparing Economically Disadvantaged Students to All Students.",
    "author": [
      {
        "name": "Aden Bhagwat, Emily Mingus, Erick Njue",
        "url": "https://adenb0220.github.io/EDLD_652_Final/"
      }
    ],
    "date": "2025-03-01",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n\r\nThis is our final graph, chosen for its accessibility and ability to convey our message. The main takeaway is that while only about half of students in all districts are proficient in reading, this proficiency percentage is even lower when only examining economically disadvantaged (ECD) students. Also, there is variation in the gap between ECD students and all students from grade to grade, but it does not seem particularly significant. While 3rd graders are separated by about 12 percentage points, 8th graders are separated by about 13 percentage points. It is possible that the discrepancy increases as grade level increases, but this would require further statistical testing. We added subtitles to both final graphs (reading and math) to ensure our message is clear.\r\n\r\n\r\n\r\n\r\n\r\nHere we created a graph with both reading and math on the same chart. We have a slight preference for keeping them separate to allow for more information to be displayed (ie. percentage labels), but this was not possible without overcrowding this version of the graph. We also added dashed lines between grade levels to make the separation easier to see at a glance.\r\nPlease see below for more iterations of this graph.\r\n\r\n\r\n\r\nAs discussed in our previous post, we experimented with multiple types of graphs and color schemes before settling on a lollipop graph. However, we still needed to make adjustments to styling and themes to have the graph be optimized for our blog. We started with the first graph, using a green and orange color palette and minimal theme.\r\n\r\n\r\n\r\n\r\n\r\n\r\nWe then decided to try making the graph color blind friendly. We added the viridis color palette but ran into an issue, each viridis palette (magma, plasma, etc.) has a bright yellow color that is very washed out on a minimal theme. We tried adding a dark theme, but that was not very aesthetically pleasing and the darker numbers were difficult to read.\r\n\r\n\r\n\r\n\r\n\r\nWe realized we could set a beginning and end to the viridis colors, which could eliminate the bright yellow and make the graph more friendly for colorblind and non-colorblind viewers. This also allowed us to keep the theme_minimal(), which matched better with the rest of our blog. We kept playing with the beginning and end values until we were satisfied that the colors looked good while still remaining accessible. As final touches, we adjusted the legend to be horizontal and near the top.\r\n\r\n\r\n\r\n\r\n\r\nFinally, we used a colorblind function to check that our graph would be accessible for different types of colorblindness. We simplified the text in the grpah to focus on the color changes, and then used the function. This satisfied our color choices, because each group was still separately identifiable, so we decided to keep our final graph as is.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2025-02-26-post-1/post-1_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2025-03-18T08:31:40-07:00",
    "input_file": {}
  }
]
